In [2]:
# Dependencies
import pandas as pd

In [4]:
# Save path to data set in a variable
data_file = "Resources/dataSet.csv"

In [10]:
# Use Pandas to read data
data_file_pd = pd.read_csv(data_file)
data_file_pd.head(12)

    id First Name Last Name Gender   Amount
0    1       Todd     Lopez      M   8067.7
1    2     Joshua     White      M   7330.1
2    3       Mary     Lewis      F  16335.0
3    4      Emily     Burns      F  12460.8
4    5  Christina    Romero      F  15271.9
5    6    Raymond   Andrews      M   7036.9
6    7     Sandra     Baker      F  14002.2
7    8       Todd      Diaz      M  10911.0
8    9      Alice     Burke      F  14198.8
9   10      Wayne  Richards      M  16410.5
10  11      Brian    Hansen      M  15029.4
11  12     Johnny    Tucker      M  16205.6

In [6]:
len(data_file_pd)

1000

In [13]:
data_file_pd[["Last Name","First Name"]]

    Last Name  First Name
0       Lopez        Todd
1       White      Joshua
2       Lewis        Mary
3       Burns       Emily
4      Romero   Christina
..        ...         ...
995      Reed       Paula
996       Fox       Paula
997   Andrews      Thomas
998    Moreno  Jacqueline
999     Young     Deborah

[1000 rows x 2 columns]

In [4]:
# Reference multiple columns within a DataFrame
data_file_pd[["Amount", "Gender"]].head()

    Amount Gender
0   8067.7      M
1   7330.1      M
2  16335.0      F
3  12460.8      F
4  15271.9      F

In [5]:
# Display a statistical overview of the DataFrame
data_file_pd.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000  10051.323600
std     288.819436   5831.230806
min       1.000000      3.400000
25%     250.750000   4854.875000
50%     500.500000  10318.050000
75%     750.250000  15117.425000
max    1000.000000  19987.400000

In [6]:
# Reference a single column within a DataFrame
data_file_pd["Amount"].head()

0     8067.7
1     7330.1
2    16335.0
3    12460.8
4    15271.9
Name: Amount, dtype: float64

In [7]:
# The mean method averages the series
average = data_file_pd["Amount"].mean()
average

10051.323600000002

In [8]:
# The sum method adds every entry in the series
total = data_file_pd["Amount"].sum()
total

10051323.600000001

In [9]:
# The unique method shows every element of the series that appears only once
unique = data_file_pd["Last Name"].unique()
unique

array(['Lopez', 'White', 'Lewis', 'Burns', 'Romero', 'Andrews', 'Baker',
       'Diaz', 'Burke', 'Richards', 'Hansen', 'Tucker', 'Wheeler',
       'Turner', 'Reynolds', 'Carpenter', 'Scott', 'Ryan', 'Marshall',
       'Fernandez', 'Olson', 'Riley', 'Woods', 'Wells', 'Gutierrez',
       'Harvey', 'Ruiz', 'Lee', 'Welch', 'Cooper', 'Nichols', 'Murray',
       'Gomez', 'Green', 'Jacobs', 'Griffin', 'Perry', 'Dunn', 'Gardner',
       'Gray', 'Walker', 'Harris', 'Lawrence', 'Black', 'Simpson', 'Sims',
       'Weaver', 'Carr', 'Owens', 'Stephens', 'Butler', 'Matthews', 'Cox',
       'Brooks', 'Austin', 'Moore', 'Hunter', 'Cunningham', 'Lane',
       'Montgomery', 'Vasquez', 'Freeman', 'Hernandez', 'Alexander',
       'Pierce', 'Mcdonald', 'Kelly', 'Foster', 'Bell', 'Johnson',
       'Bowman', 'Porter', 'Wood', 'Reid', 'Willis', 'Bishop',
       'Washington', 'Gonzales', 'Davis', 'Martinez', 'Martin', 'Long',
       'Howell', 'Hawkins', 'Knight', 'Price', 'Day', 'Bailey', 'Flores',
       'Young', 'Evans', 'Cruz', 'Chavez', 'Barnes', 'Coleman', 'Burton',
       'Clark', 'Carter', 'Franklin', 'Ellis', 'Miller', 'Allen', 'Mason',
       'Patterson', 'Stevens', 'Kim', 'Kelley', 'Robinson', 'Hughes',
       'Morgan', 'Dean', 'Stewart', 'Murphy', 'Fox', 'Simmons',
       'Thompson', 'Fuller', 'Peterson', 'Hanson', 'Wright', 'Reed',
       'Graham', 'Parker', 'Boyd', 'Taylor', 'Greene', 'George', 'Mills',
       'Duncan', 'Hill', 'Jordan', 'Stanley', 'Hall', 'James', 'Stone',
       'Warren', 'Fowler', 'Williamson', 'Lynch', 'Harper', 'Little',
       'Nguyen', 'Morrison', 'Ramirez', 'Howard', 'Watkins', 'Robertson',
       'Powell', 'Sanchez', 'Sanders', 'Grant', 'Ross', 'Mitchell',
       'Henderson', 'Rose', 'Perez', 'Berry', 'Watson', 'Gordon',
       'Morales', 'Arnold', 'Morris', 'Crawford', 'Smith', 'Medina',
       'Alvarez', 'Collins', 'Rodriguez', 'Mccoy', 'Bennett',
       'Richardson', 'Chapman', 'Johnston', 'Gilbert', 'Ford', 'Russell',
       'Nelson', 'Castillo', 'Cole', 'Rice', 'Payne', 'Frazier', 'Webb',
       'Armstrong', 'Wilson', 'Garza', 'Garrett', 'Spencer', 'Peters',
       'Sullivan', 'Brown', 'Williams', 'Gonzalez', 'Palmer', 'Fields',
       'Snyder', 'Jackson', 'Edwards', 'Anderson', 'Cook', 'Ramos',
       'Harrison', 'Lawson', 'Banks', 'Wallace', 'Ortiz', 'Gibson',
       'Reyes', 'Shaw', 'Ward', 'Perkins', 'Bradley', 'Rivera', 'Jenkins',
       'Hart', 'Phillips', 'Garcia', 'Fisher', 'King', 'Larson', 'Hunt',
       'Jones', 'Hudson', 'Myers', 'Hayes', 'Dixon', 'Schmidt', 'Moreno',
       'Rogers', 'Thomas', 'Meyer', 'Daniels', 'Bryant', 'Henry',
       'Campbell', 'Ferguson', 'Oliver', 'Ray', 'Carroll', 'Wagner',
       'Kennedy', 'Holmes'], dtype=object)

In [10]:
# The value_counts method counts unique values in a column
count = data_file_pd["Gender"].value_counts()
count

M    515
F    485
Name: Gender, dtype: int64

In [17]:
data_file_pd["First Name"].value_counts()

Robin     12
Jose      11
Paula     10
Larry     10
Randy     10
          ..
Denise     1
Diane      1
Anne       1
Irene      1
Steven     1
Name: First Name, Length: 197, dtype: int64

In [11]:
# Calculations can also be performed on Series and added into DataFrames as new columns
data_file_pd["Thousands of Dollars"] = data_file_pd["Amount"]/1000

data_file_pd.head()

   id First Name Last Name Gender   Amount  Thousands of Dollars
0   1       Todd     Lopez      M   8067.7                8.0677
1   2     Joshua     White      M   7330.1                7.3301
2   3       Mary     Lewis      F  16335.0               16.3350
3   4      Emily     Burns      F  12460.8               12.4608
4   5  Christina    Romero      F  15271.9               15.2719

In [20]:
data_file_pd['Full Name']=data_file_pd['First Name']+' '+data_file_pd['Last Name']

In [21]:
data_file_pd

       id  First Name Last Name Gender   Amount          Full Name
0       1        Todd     Lopez      M   8067.7         Todd Lopez
1       2      Joshua     White      M   7330.1       Joshua White
2       3        Mary     Lewis      F  16335.0         Mary Lewis
3       4       Emily     Burns      F  12460.8        Emily Burns
4       5   Christina    Romero      F  15271.9   Christina Romero
..    ...         ...       ...    ...      ...                ...
995   996       Paula      Reed      F  17868.5         Paula Reed
996   997       Paula       Fox      F  15182.9          Paula Fox
997   998      Thomas   Andrews      M   3720.7     Thomas Andrews
998   999  Jacqueline    Moreno      F  10824.6  Jacqueline Moreno
999  1000     Deborah     Young      F   6090.7      Deborah Young

[1000 rows x 6 columns]